### Terraform Plan — `dev` 📋

<details>
<summary>Click to expand plan output</summary>

```hcl
time=2026-03-14T20:50:20Z level=info msg=The stack at /home/runner/work/devops-infra-live/devops-infra-live/environments/dev will be processed in the following order for command plan:
Group 1
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc

Group 2
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet

Group 3
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds

Group 4
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb
- Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table


time=2026-03-14T20:50:21Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 
time=2026-03-14T20:50:21Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge/.terragrunt-cache/MdcOvC9mbd0-zozvtHjRtXGnQ64/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/eventbridge] 
time=2026-03-14T20:50:21Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc/.terragrunt-cache/9nDsOlT7I_lvOukZjWAdmTXrxr8/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc] 
time=2026-03-14T20:50:21Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 
time=2026-03-14T20:50:21Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 
time=2026-03-14T20:50:21Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 
time=2026-03-14T20:50:21Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3/.terragrunt-cache/Di5wular24ljuRwSQeQGhJt_0XY/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/s3] 
time=2026-03-14T20:50:21Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb/.terragrunt-cache/j5exsj6NnfORRmFvgA4ZFTJl4Es/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/dynamodb] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...
time=2026-03-14T20:50:23Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...
time=2026-03-14T20:50:24Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...
time=2026-03-14T20:50:25Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.
time=2026-03-14T20:50:27Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
aws_vpc.this["spoke-vpc"]: Refreshing state... [id=vpc-02044a418a9bf87c7]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_vpc.this["spoke-vpc"] must be replaced
-/+ resource "aws_vpc" "this" {
      ~ arn                                  = "arn:aws:ec2:us-west-2:978184426471:vpc/vpc-02044a418a9bf87c7" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.0.0.0/16" -> "10.0.0.0/24" # forces replacement
      ~ default_network_acl_id               = "acl-010431f1a46b2b43e" -> (known after apply)
      ~ default_route_table_id               = "rtb-0397b35f622a7d9a0" -> (known after apply)
      ~ default_security_group_id            = "sg-093e443791357285b" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-04efc404011c39405" -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-02044a418a9bf87c7" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0397b35f622a7d9a0" -> (known after apply)
      ~ owner_id                             = "978184426471" -> (known after apply)
        tags                                 = {
            "ManagedBy" = "terraform"
            "Name"      = "spoke-vpc"
            "Project"   = "my-infra"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  ~ vpc_cidr_blocks = {
      ~ spoke-vpc = "10.0.0.0/16" -> "10.0.0.0/24"
    }
  ~ vpc_ids         = {
      ~ spoke-vpc = "vpc-02044a418a9bf87c7" -> (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-03-14T20:50:40Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet] 
time=2026-03-14T20:50:40Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group/.terragrunt-cache/weEwUy_RnL4mGvY5_VLvT2ISOOE/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group] 
time=2026-03-14T20:50:40Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53/.terragrunt-cache/0SZjPEBwXsWiGLqBRnwrz1cup2s/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route53] 
time=2026-03-14T20:50:40Z level=info msg=Downloading Terraform configurations from file:///home/runner/work/devops-infra-live/devops-infra-live/modules into /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway/.terragrunt-cache/_trL-EihvDfxyyWeEbqnbUArHyA/KD9Uz34UoKkZiNL9nShh8OWWCNo prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Finding hashicorp/aws versions matching "~> 5.0"...
- Installing hashicorp/aws v5.100.0...
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
- Installed hashicorp/aws v5.100.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_subnet.this["private-subnet"] will be created
  + resource "aws_subnet" "this" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.0.64/26"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "ManagedBy" = "terraform"
          + "Name"      = "private-subnet"
          + "Project"   = "my-infra"
        }
      + tags_all                                       = {
          + "ManagedBy" = "terraform"
          + "Name"      = "private-subnet"
          + "Project"   = "my-infra"
        }
      + vpc_id                                         = "vpc-02044a418a9bf87c7"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
time=2026-03-14T20:50:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet has finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet] 
time=2026-03-14T20:50:53Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2] 
time=2026-03-14T20:50:53Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb] 
time=2026-03-14T20:50:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2] 
time=2026-03-14T20:50:53Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda] 
time=2026-03-14T20:50:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda] 
time=2026-03-14T20:50:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb] 
time=2026-03-14T20:50:53Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache] 
time=2026-03-14T20:50:53Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway] 
time=2026-03-14T20:50:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache] 
time=2026-03-14T20:50:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway] 
time=2026-03-14T20:50:53Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds] 
time=2026-03-14T20:50:53Z level=error msg=Dependency /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet of module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table just finished with an error. Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table will have to return an error too. prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table] 
time=2026-03-14T20:50:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds] 
time=2026-03-14T20:50:53Z level=error msg=Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table has finished with an error: Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1

 prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table] 

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
aws_internet_gateway.this["spoke-vpc-igw"]: Refreshing state... [id=igw-0fd767112c5d55e45]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
time=2026-03-14T20:50:56Z level=info msg=Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.


Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.

time=2026-03-14T20:50:25Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront] 

time=2026-03-14T20:50:56Z level=info msg=Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.


Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.

time=2026-03-14T20:50:27Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs] 

time=2026-03-14T20:50:56Z level=info msg=Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.


Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.

time=2026-03-14T20:50:24Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns] 

time=2026-03-14T20:50:56Z level=info msg=Terraform encountered problems during initialisation, including problems
with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.

Error: Invalid character

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

The ";" character is not valid. Use newlines to separate arguments and
blocks, and commas to separate items in collection values.


Error: Invalid single-argument block definition

  on variables.tf line 2, in variable "project":
   2: variable "project" { type = string; default = "devops-ai" }

A single-line block definition must end with a closing brace immediately
after its single argument definition.

time=2026-03-14T20:50:23Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs] 

time=2026-03-14T20:50:56Z level=info msg=
Error: "10.0.0.1/24" is not a valid IPv4 CIDR block; did you mean "10.0.0.0/24"?

  with aws_subnet.this["subnet1-public"],
  on main.tf line 5, in resource "aws_subnet" "this":
   5:   cidr_block              = each.value.cidr_block

time=2026-03-14T20:50:53Z level=error msg=terraform invocation failed in /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet prefix=[/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet] 

time=2026-03-14T20:50:56Z level=error msg=12 errors occurred:
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/alb (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/lambda (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/route-table (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/internet-gateway, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/cloudfront/.terragrunt-cache/VYKfGQQ02mhJZzQWnIO0BLZUxCI/KD9Uz34UoKkZiNL9nShh8OWWCNo/cloudfront] exit status 1
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ec2 (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1


	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/nat-gateway (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/ecs/.terragrunt-cache/X08kd6qnIblHXbZ9pAy2NHhjGVI/KD9Uz34UoKkZiNL9nShh8OWWCNo/ecs] exit status 1
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/rds (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sqs/.terragrunt-cache/WBpxQhozj-8kmcJr-zZv2FopCVU/KD9Uz34UoKkZiNL9nShh8OWWCNo/sqs] exit status 1
	* Cannot process module Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/elasticache (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet, /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/security-group]) because one of its dependencies, Module /home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet (excluded: false, assume applied: false, dependencies: [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/vpc]), finished with an error: 1 error occurred:
	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/subnet/.terragrunt-cache/yTjBilEb-WSBG7KpV887sR0jBc4/KD9Uz34UoKkZiNL9nShh8OWWCNo/subnet] exit status 1


	* [/home/runner/work/devops-infra-live/devops-infra-live/environments/dev/sns/.terragrunt-cache/0J7IUSfpI53jqACebbA51pV-MgY/KD9Uz34UoKkZiNL9nShh8OWWCNo/sns] exit status 1



```

</details>

*Merge this PR to apply changes for project `dev`.*